<template>
    <div class="blogCss">
        <div class="blog">
            <div class="blogTitle">微软雅黑TMD是有版权的</div>
            <div class="blogContent" v-highlight v-betterpre>
                <p>起因据传是因为一家公司实习生使用微软雅黑和盗版PS软件，印制5000万张样稿，并用于商业用途，导致公司遭到起诉，损失达2860万元。</p>
                <p>“微软雅黑”与“方正字库”到底是什么关系？北京青年报的记者日前以咨询者身份向方正字库客服人员进行了询问。</p>
                <p>对方解释称，早在微软公司进入中国的时候，微软公司就委托北大方正创作了微软雅黑字体，<b>但版权仍归北大方正所有</b>。用户使用Windows操作系统时，微软雅黑字体在屏幕上显示或用于个人为目的的打印，均可免费使用；但若以“商业发布”为目的，需要支付版权费。付费字体中，所谓基础字体的授权使用费为每款每年7000元，所谓精品字体<b>授权使用费高达每款每年20000元</b>。</p>
                <p>微软雅黑字体是微软公司委托北京北大方正制作的，微软公司只拥有微软雅黑的使用权，<b>版权属于方正</b>。</p>
                <p>也就是如果是链接外部系统和打印的内容，需要用于商业的话，得获得版权方许可。说的直白一点就是<b>脱离Windows平台的一切商业行为，都属于侵权</b>！</p>
                <hr />
                <pre>
                    网站上使用“微软雅黑”字体有三种形式：
                    1、图片中使用“微软雅黑”字体，比如网站头图；
                    2、网站CSS用font-family声明网站使用“微软雅黑”字体，比如文章标题和正文；
                    3、网站通过font-face引用“微软雅黑”，这种方式不常见。
                    三种形式只有一种不会设计侵权
                </pre>
                <p>第一种情况，图片上使用“微软雅黑”字体，<b>肯定涉及版权问题</b>。</p>
                <p>第二种情况，<b>网站代码只了CSS声明</b>，“微软雅黑”字体的文件是用户的客户端提供的，如果客户端电脑有“微软雅黑”字体，就会显示“微软雅黑”样式，如果客户端电脑用了是Windows XP系统，或者英文操作系统没有“微软雅黑”字体，那么会显示宋体。<b>这种方式不会涉及到版权问题</b>。</p>
                <p>第三种情况，这种方式相当于把“微软雅黑”<b>字体文件上传到网站服务器</b>，它会在需要的时候下载到客户端电脑，即便是WinXP客户端观看网页，或者没有“微软雅黑”字体的英文操作系统，网页依然会显示“微软雅黑”字体样式，<b>这种方式会涉及版权问题</b>。</p>
                <p>在版权面前我还是选择低头，毕竟谁也不想面对那么高的侵权费，所以大家在使用字体的时候还是多加注意，<b>记住这些免费的字体</b>。</p>
                <p>比如：<b>宋体、仿宋、黑体、楷体、隶书、大篆、小篆、简书、章草、行书、今草、魏碑、狂草、行草和幼圆</b>。</p>
                <p class="text-danger">宋体：SimSun, 新宋体：NSimSun, 仿宋：FangSong, 仿宋_GB2312：FangSong_GB2312, 标楷体：DFKai-SB, 楷体_GB2312：KaiTi_GB2312, 楷体_GB2312：KaiTi_GB2312黑体：SimHei, 楷体：KaiTi, 隶书：LiSu</p>
                <p>新细明体：PMingLiU 微软正黑体：Microsoft JhengHei 微软雅黑体：Microsoft YaHei 幼圆：YouYuan 华文细黑：STXihei 华文行楷：STXingkai 华文新魏：STXinwei 细明体：MingLiU 微软正黑体：Microsoft JhengHei 微软雅黑体：Microsoft YaHei</p>
                <hr />
                <p></p>
                <p>https://www.yestone.com/fonts/charge 买字体</p>
                <p>马小帽 2019/09/06 10:14:13 : 文鼎字体，大概2000左右 一年一台的价格</p>
                <p>可用范围</p>
                <pre>
                    1）以产生图形方式或将字型外框化后，允许微调，用于设计企业名称、标志或Logo等，并得将所设计之作品应用于下列第（2）至（7）项目。
                    2）印刷品：设计各种材质之印刷品，如：书籍、杂志、型录、宣传品、产品说明书、名片、信封、产品 包装、纪念品或T-Shirt等，并得自行印刷或委由他人印刷上述印刷品。发行数量、发行方式及发 行范围不限。
                    3）多媒体广告：设计制作各类媒介广告，如海报、电视／电影广告、平面广告、户外广告、网络广告、招牌、广告牌、告示牌等，且不限制广告之发布数量、发布方式及发布范围。
                    4）网站设计：于设计制作网站时，使用本服务以产生图形方式设计网页。
                    5）可携式电子文件：使用本服务内嵌字型于产品手册、说明书、样册等可携式电子文件（如PDF或ePub），该电子文件不得单独销售。
                    6）以产生图形方式应用于一般软件、APP应用软件或游戏软件。
                    7）以产生图形方式应用于电视、电影、影片、动画等影视作品之标题或字幕。
                </pre>
                <p>不可用范围</p>
                <pre>
                    1）使用本服务产品中任何单字或多个字直接供自身或他人作为注册商标申请图样之全部或一部。
                    2）以字型嵌入技术或转换成任何可替代原字型之数据（例如点阵字型）的形式，应用于各类媒介。
                    3）使用本服务产品以字型嵌入技术应用于电子书、电子杂志等，并进行销售或租赁。
                    4）内嵌字型于可携式电子文件，且将该电子文件单独销售。
                    5）其他未经本授权书许可之各种使用。
                </pre>
                <p></p>
            </div>
            <div class="blogFooter">
                <Tag color="green">收集</Tag>
                <Tag color="cyan">学习</Tag>
                <Tag color="blue">增长</Tag>
            </div>
        </div>
    </div>
</template>
<script>
export default {
    data () {
        return {}
    },
    methods: {
    },
    mounted () {
    }
}
</script>
