<template>
    <div class="blogCss">
        <div class="blog">
            <div class="blogTitle">软件界面易用性总结</div>
            <div class="blogContent" v-highlight>
                <p>软件的智能和记忆功能</p>
                <p class="text-danger">1.用户登录界面最好有用户名和ID的记忆，焦点直接定位到密码输入框</p>
                <p>2.单据录入界面最好有保存和载入默认值的功能</p>
                <p class="text-danger">3.单据搜索界面可以保存用户自定义的各种搜索条件组合</p>
                <p class="text-danger">4.用户调整过的GRID的列宽，窗口的位置可以自动记忆</p>
                <p class="text-danger">5.系统可以根据用户的使用频度对相关功能进行自动的优先级排序</p>
                <p>6.系统能够记忆不同用户的使用偏好，使用系统的固有模式和常用的自定义设置</p>
                <br>
                <p>减少不必要的重复交互</p>
                <p class="text-danger">1.减少不必要的各种操作，能够点一次鼠标或敲一次键盘完成的绝不作出两次或多次。</p>
                <p class="text-danger">2.提示信息要适度，太多不好，太少也不好。</p>
                <p>3.数据项完整性校验问题要注意光标焦点自动定位到错误处</p>
                <p>4.完整业务功能不要让用户在多个窗口切换多次才能够完成。尽量减少这种切换。</p>
                <p>5.为了方便用户切换窗口，相关的表单最好都作为非模式的形式。</p>
                <p class="text-danger">6.相同的信息不要让用户在系统中多处或多次录入，保证入口的唯一性</p>
                <p>7.系统要尽可能根据用户已经录入信息自动获取其它附属信息，而不需要用户重复的选择或录入。</p>
                <br>
                <p>导航和界面跳转</p>
                <p class="text-danger">1.表单新弹出对话框，对话框再弹出对话框的这种层次要控制在3层以内。</p>
                <p>2.所有的非模式活动窗口最好有类似桌面任务栏一样的停靠方式，方便切换窗口</p>
                <p class="text-danger">3.系统可以支持用户自己定义常用功能和菜单</p>
                <p class="text-danger">4.对于常用功能应该提供便捷的快捷键和工具栏按钮</p>
                <p>5.对于系统中提供的各种业务和表单功能能够让用户便捷挑转到帮助信息上</p>
                <p class="text-danger">6.对表单和界面联动和交互的时候要注意相关界面数据的自动刷新</p>
                <p class="text-danger">7.一个窗口中最多不要出现超过三个的GRID控件</p>
                <p class="text-info">8.BS方式不要左右滚屏。CS模式既要避免左右滚屏也要避免上下滚屏</p>
                <p>9.需要根据业务查看需求和数据的展现需求来选择合适的界面控件</p>
                <br>
                <p>系统性能和健壮性方面的</p>
                <p class="text-danger">1.系统中相关的耗时操作都必须必须转变鼠标为等待状态</p>
                <p class="text-danger">2.系统耗时操作超过30秒的最好能够提供给用户相关的进度条功能</p>
                <p>3.系统耗时功能超过2分钟的最好能够设计为异步多线程的方式进行处理</p>
                <p>4.系统应用有友好的完整性和约束校验的提示信息，方便用户修改录入数据</p>
                <p class="text-danger">5.在系统出现异常情况下应该有友好的统一的提示信息，同时后台应该记录详细的异常日志</p>
                <br>
                <p>界面友好性和易用性方面的</p>
                <p class="text-danger">1.表单应该能够根据屏幕分辩率自动适应。在界面上让用户一次能够看到足够多的信息</p>
                <p>2.表单应该支持Tab键功能，顺序为从左到右，从上到下。</p>
                <p>3.常用的表单应该同时支持键盘操作和鼠标操作。</p>
                <p>4.界面上控件的布局应该间距适当，标签和控件对齐，有适当的录入提示信息。</p>
                <p class="text-danger">5.界面的配色应该尽量简单，尽量少使用各种刺眼的颜色</p>
                <p class="text-danger">6.用户看到表单后应该就基本清楚相关功能，表单要尽量自我解释，不要设计过多的隐含在界面里面功能</p>
                <br>
                <p>数据的录入和检索</p>
                <p>1.根据业务需要选择适合的数据录入控件</p>
                <p class="text-danger">2.数据录入控件应该有完备的数据完整性和一致性校验功能</p>
                <p class="text-danger">3.系统应该提供用户暂时保存录入数据的功能</p>
                <p class="text-danger">4.能够自动获取数据不要让用户再去录入，能够选择录入数据不要让用户手工录入</p>
                <p>5.数据检索条件应该适中，不应太多也不应太少。检索支持组合条件检索。</p>
                <p class="text-danger">6.为了满足不同需求检索可以提供简单检索和高级检索多种方式。</p>
                <p>7.应该在第一时间提供给用户检索数据，因此检索功能存在性能问题时候要考虑分页。</p>
                <p>8.在检索功能较耗时的时候应该提供给用户相关的进度条显示进度</p>
                <p class="text-danger">9.表格最好能够提供行显示和列显示等多种显示模式，方面用户查看数据</p>
                <hr>
                <p>简要来说，可以对“网站易用性”做如下理解：</p>
                <ul>
                    <li> 1、易理解：单凭观察，用户能否在几秒内就知道网站是做什么的，以及知道如何采取行动。</li>
                    <li> 2、易操作：用户初次接触网站时，是否可以很轻松的完成任务，是否可以不用帮助文档就能使用网站。</li>
                    <li> 3、易学习：通过简单的帮助文档，用户能否顺利解决遇到的问题。</li>
                    <li> 4、效率性：用户熟悉网站功能或界面后，是否可以快速完成任务。</li>
                    <li> 5、出错率：在使用网站过程中，用户操作出现的错误有多少，这些错误有多严重，从错误中回复是否容易。</li>
                    <li> 6、满意度：用户使用这个网站，是否有较高的满意度。</li>
                </ul>
            </div>
            <div class="blogFooter">
                <Tag color="green">green</Tag>
                <Tag color="cyan">cyan</Tag>
                <Tag color="blue">blue</Tag>
            </div>
        </div>
    </div>
</template>
<script>
export default {
    data () {
        return {}
    },
    methods: {
    },
    mounted () {
    }
}
</script>
