<template>
    <div class="blogCss">
        <div class="blog">
            <div class="blogTitle">开发与需求的两难困境</div>
            <div class="blogContent">
                <p>（顾客去饭店，坐下来。）</p>
                <p>顾客：“服务员，给我来份宫保鸡丁！”</p>
                <p>服务员：“好嘞！一份宫保鸡丁~”</p>
                <p class="text-danger">——————这叫原始需求</p>
                <p>大厨：“好嘞”</p>
                <p>（大厨做到一半。餐厅。）</p>
                <p>顾客：“服务员，菜里不要放肉。”</p>
                <p>服务员：“不放肉怎么做啊？”</p>
                <p>顾客：“不放肉就行了，其它按正常程序做，不就行了，难吗？”</p>
                <p>服务员：“好的您稍等。”<span class="text-info">----(没有深入了解需求变更的原因)</span></p>
                <p class="text-danger">——————中途需求变更</p>
                <p>（厨房发生争吵。）</p>
                <p>大厨：“你大爷，我肉都回锅了”</p>
                <p>服务员：“顾客非要要求的嘛，你把肉挑出来不就行了吗”</p>
                <p>大厨：“行你大爷”</p>
                <p>大厨：（然而还是一点点挑出来了。）<span class="text-info">----(没有分析原因)</span></p>
                <p class="text-danger">——————改动太大，部分重构</p>
                <p>（大厨做到一半。餐厅。）</p>
                <p>顾客：“服务员，菜里能给我加点腐竹吗？”</p>
                <p>服务员：“行，这个应该简单。”<span class="text-info">----(不经历沟通的立项)</span></p>
                <p class="text-danger">——————低估改动成本</p>
                <p>（厨房发生争吵。）</p>
                <p>大厨：“你TMD，不知道腐竹得提前泡水？炒到一半才说？跟他说，想吃腐竹就多等半天。”</p>
                <p>服务员：“啊你怎么不早说？”<span class="text-info">----(甩锅行为)</span></p>
                <p>大厨：“早说你MLGB，我怎么知道他要往宫保鸡丁里放腐竹？”</p>
                <p>（然而还是去泡腐竹了......。）</p>
                <p class="text-danger">——————新需求引入了新研发成本</p>
                <p>（大厨做到一半。餐厅。）</p>
                <p>顾客：“服务员，还是把肉加回去吧。”</p>
                <p>服务员：“您不是刚说不要肉吗？”</p>
                <p>顾客：“现在又想要了。”</p>
                <p>服务员：“……好的您稍等。”<span class="text-info">----(不知有来有往)</span></p>
                <p class="text-danger">——————某一功能点摇摆不定</p>
                <p>（厨房发生争吵。）</p>
                <p>大厨：“日你啊，菜都炒过火了你让我放肉？还好肉我没扔。”</p>
                <p>服务员：“客户提的要求你日我干嘛？”<span class="text-info">----(甩锅行为)</span></p>
                <p>大厨：“你就不能拒绝他啊？啊？”</p>
                <p>服务员：“人家是客户嘛。”</p>
                <p class="text-danger">——————甲方是大爷</p>
                <p>（大厨做到一半。餐厅。）</p>
                <p>顾客：“服务员！服务员！”</p>
                <p>服务员：“来了来了，你好？”</p>
                <p>顾客：“怎么这么半天啊？”</p>
                <p>服务员：“稍等我给您催催啊。”<span class="text-info">----(接待官变成了传话筒)</span></p>
                <p class="text-danger">——————改动开始导致工期延误</p>
                <p>（厨房发生争吵。）</p>
                <p>大厨：“催你M催，腐竹没泡好，我还得重新放油，他要想吃老的也行，没法保质保量。”</p>
                <p class="text-danger">——————开发者请求重新排期</p>
                <p>（餐厅。）</p>
                <p>服务员：“抱歉，加腐竹的话得多等半天，您别着急哈。”</p>
                <p>顾客：“我靠要等那么久？我现在就要吃，你们能快点吗？”</p>
                <p>服务员：“行……您稍等”<span class="text-info">----(不知自己的责任)</span></p>
                <p class="text-danger">——————甲方催活</p>
                <p>（厨房发生争吵。）</p>
                <p>大厨：“我日他仙人板板，中途改需求又想按期交付，逗我玩呢？”</p>
                <p>服务员：“那我问问，要不让他们换个菜？”</p>
                <p>大厨：“再换我就死了！”</p>
                <p class="text-danger">——————开发者开始和中间人pk</p>
                <p>（餐厅。）</p>
                <p>顾客：“服务员，这样吧，腐竹不要了，换成蒜毫能快点吗？对了，顺便加点番茄酱。”</p>
                <p class="text-danger">——————因工期过长再次改动需求</p>
                <p>（厨房发生争吵。）</p>
                <p>大厨：“我日了狗啊，你TM不知道蒜毫也得焯水啊？还有你让我怎么往热菜里放番茄酱啊？？”</p>
                <p>服务员：“焯水也比等腐竹强吧，番茄酱往里一倒不就行了吗？很难吗？”</p>
                <p>大厨：“草。腐竹我还得接着泡，万一这孙子一会又想要了呢。”</p>
                <p class="text-danger">——————频繁改动开始导致大量冗余</p>
                <p>（餐厅。）</p>
                <p>顾客：“服务员，菜里加茄丁了没有？我去其它饭店吃可都是有茄丁的。”</p>
                <p>服务员：“好好好您稍等您稍等。”<span class="text-info">----(不经历沟通的立项)</span></p>
                <p class="text-danger">——————奇葩需求</p>
                <p>（厨房发生争吵。）</p>
                <p>大厨：“我去他二大爷他吃的是斯里兰卡三流技校炒的宫保鸡丁吗？宫保鸡丁里放茄丁？？”</p>
                <p>服务员：“茄丁抄好了扔里边不就行了吗？”<span class="text-info">----(甩锅行为)</span></p>
                <p>大厨：“那TM还能叫菜吗？哪个系的？”</p>
                <p>服务员：“客户要，你就给炒了吧。”</p>
                <p>大厨：“MB你顺道问问他腐竹还要不要，我这盆腐竹还占着地方呢不要我就扔了。”</p>
                <p class="text-danger">——————奇葩你也得做</p>
                <p>（餐厅。）</p>
                <p>顾客：“服务员，还要多久能好啊？”</p>
                <p>服务员：“很快，很快……”</p>
                <p>顾客：“再给我来杯西瓜汁。”</p>
                <p>服务员：“……好”</p>
                <p>顾客：“我再等10分钟，还不好我就走了，反正还没给钱。”</p>
                <p>服务员：“很快，很快……”</p>
                <p class="text-danger">——————黑暗前的最后黎明</p>
                <p>（10分钟后：）</p>
                <p>顾客：“咦，我上次吃的不是这个味啊？”</p>
                <p>从厨房杀出来的大厨：“我TM就日了你的狗……”</p>
                <p class="text-danger">——————最终决战 ——————</p>
                <h2 class="text-info">后来 大厨的暴脾气吓跑了服务员...</h2>
                <p></p>
            </div>
            <div class="blogFooter">
                <Tag color="green">收集</Tag>
                <Tag color="cyan">学习</Tag>
                <Tag color="blue">增长</Tag>
            </div>
        </div>
    </div>
</template>
<script>
export default {
    data () {
        return {}
    },
    methods: {
    },
    mounted () {
    }
}
</script>
