<template>
    <div class="blogCss">
        <div class="blog">
            <div class="blogTitle">ascii 绘制的 有意义图片</div>
            <div class="blogContent" v-highlight>
                <p><Icon type="md-checkmark" style="color:green"/> 有效</p>
                <p><Icon type="md-close" style="color:red"/> ------------------------------------------ </p>
                <pre>
                    |                     .....               d*##$.
                    |                   zP"""""$e.           $"    $o
                    |                  4$       '$          $"      $
                    |                  '$        '$        J$       $F
                    |                   'b        $k       $>       $
                    |                    $k        $r     J$       d$
                    |                    '$         $     $"       $~
                    |                     '$        "$   '$E       $
                    |                      $         $L   $"      $F ...
                    |                       $.       4B   $      $$$*"""*b
                    |                       '$        $.  $$     $$      $F
                    |                        "$       R$  $F     $"      $
                    |                         $k      ?$ u*     dF      .$
                    |                         ^$.      $$"     z$      u$$$$e
                    |                          #$b             $E.dW@e$"    ?$
                    |                           #$           .o$$# d$$$$c    ?F
                    |                            $      .d$$#" . zo$>   #$r .uF
                    |                            $L .u$*"      $&$$$k   .$$d$$F
                    |                             $$"            ""^"$$$P"$P9$
                    |                            JP              .o$$$$u:$P $$
                    |                            $          ..ue$"      ""  $"
                    |                           d$          $F              $
                    |                           $$     ....udE             4B
                    |                            #$    """"` $r            @$
                    |                             ^$L        '$            $F
                    |                               RN        4N           $
                    |                                *$b                  d$
                    |                                 $$k                 $F
                    |                                  $$b                $F
                    |                                   $""               $F
                    |                                   '$                $
                    |                                    $L               $
                    |                                    '$               $
                    |                                     $               $
                </pre>
                <pre>
                    |                                            ,:
                    |                                          ,' |
                    |                                         /   :
                    |                                      --'   /
                    |                                      \/ /:/
                    |                                      / ://_\
                    |                                   __/   /
                    |                                   )'-. /
                    |                                   ./  :\
                    |                                    /.' '
                    |                                  '/'
                    |                                  +
                    |                                 '
                    |                               `.
                    |                           .-"-
                    |                          (    |
                    |                       . .-'  '.
                    |                      ( (.   )8:
                    |                  .'    / (_  )
                    |                   _. :(.   )8P  `
                    |               .  (  `-' (  `.   .
                    |                .  :  (   .a8a)
                    |               /_`( "a `a. )"'
                    |           (  (/  .  ' )=='
                    |          (   (    )  .8"   +
                    |            (`'8a.( _(   (
                    |         ..-. `8P    ) `  )  +
                    |       -'   (      -ab:  )
                    |     '    _  `    (8P"Ya
                    |   _(    (    )b  -`.  ) +
                    |  ( 8)  ( _.aP" _a   \( \   *
                    |+  )/    (8P   (88    )  )
                    |   (a:f   "     `"`
                </pre>
                <pre>
                    |                 .-~~~~~~~~~-._       _.-~~~~~~~~~-.
                    |            __.'              ~.   .~              `.__
                    |          .'//                  \./                  \\`.
                    |        .'//                     |                     \\`.
                    |      .'// .-~"""""""~~~~-._     |     _,-~~~~"""""""~-. \\`.
                    |    .'//.-"                 `-.  |  .-'                 "-.\\`.
                    |  .'//______.============-..   \ | /   ..-============.______\\`.
                    |.'______________________________\|/______________________________`.
                </pre>
            </div>
            <div class="blogFooter">
                <Tag color="green">收集</Tag>
                <Tag color="cyan">学习</Tag>
                <Tag color="blue">增长</Tag>
            </div>
        </div>
    </div>
</template>
<script>
export default {
    data () {
        return {}
    },
    methods: {
    },
    mounted () {
    }
}
</script>
