<template>
    <div>
        <div class="tableLayout">
            <div class="tableHeader">
                <h2>通过姓的第一个字来快速展示信息</h2>
            </div>
            <div class="tableTool">
                <Input type="text" v-model.trim="name" placeholder="请输入" style="width: 180px"/>
            </div>
            <Row>
                <Col span="12">
                    <h3>港台</h3>
                    <Tag color="green" v-for="(item, index) in items1" :key="'xx'+index">{{item.name}}</Tag>
                </Col>
                <Col span="12">
                    <h3>国内</h3>
                    <Tag color="green" v-for="(item, index) in items2" :key="'xx'+index">{{item.name}}</Tag>
                </Col>
            </Row>
        </div>
    </div>
</template>
<script>
export default {
    data () {
        return {
            name: ''
            // {name: ''}, {name: ''}, {name: ''}, {name: ''}, {name: ''}, 孙怡米勒焦俊艳逯恣祯李溪芮刘美含刘萌萌景甜李一桐杨旭文梁洁毛俊杰万茜柳希龙郑业成李晟陈小纭黄礼格徐冬冬宋威龙袁冰妍付辛博沈梦辰陈钰琪蓝盈莹方文强鄂博阎汶宣舒畅牛骏峰李小萌马苏白雪张哲瀚鞠婧祎吕佳容张浩施诗张嘉倪李菲儿王亭文范世錡海陆马薇邢菲陆毅郭俊辰张丹峰孔垂楠施予斐穆婷婷盛一伦任天野刘奕君杨舒刘庭羽严屹宽孙俪金晨王晓晨任嘉伦李砚尹淇韩栋康杰袁弘韩东君于和伟于晓光陈洁于明加热依扎张维娜杨之楹郑恺蒋蕊泽林源张芷溪苏青蓝波杨志刚韩雪白百何李佳奇晏紫东李健高伟光李进荣孙骁骁米热朱一龙于震宋小宝刘芮麟黄渤宋祖儿李兰迪王力可康磊李小冉叶祖新于毅蒋依依李林娟刘波王俊凯胡一天秦海璐石悦安鑫娄清刘娜萍秦语俞飞鸿姚星彤刘楚恬王千源阮圣文孙雪宁李倩祝绪丹颜丹晨母其弥雅刘雅瑟陈紫函应昊茗刘晓洁闫妮刘启恒丁程鑫李梦宋妍霏金瀚尹智玄杨明娜李宗翰虞朗袁志博刘敏任重吴昊宸孙艺洲刘笑歌毛林林何泓姗李郁瞳沈佳妮袁泉宋佳马蜀君尤靖茹闫学晶聂子皓尚语贤俞灏明黄轩吕卓燃李飞周奇奇张予曦刘文曲刘秋实李蓓蕾佟大为刘欢潘之琳梁超泓萱苗驰卢宇静余少群童菲王美人刘颖伦熊乃瑾张碧晨刘黛希马秋子刘烨宋家腾买红妹祖峰瑛子江珊杨雨婷刘成瑞李金铭柯蓝艾晓琪刘馨棋侯梦莎孙铱白宇杜淳马春瑞雨婷儿杨帆韩庚隋雨蒙李颖何晟铭梁亦芸陆子艺张雨绮刘涛于月仙孙坚岳丽娜袁文康梁浩盛冠森李春嫒阳蕾刘恩佑杨梓墨李子峰吴谨言张睿孙茜李茂荣梓杉陆妍淇荣蓉任帅黄一琳原雨殷桃梅婷辛芷蕾刘烨翟天临李欣聪张晓谦李雨轩王珂吴秀波姚笛马伊琍沈腾刘智扬邵兵张楷依于函冰柴碧云刘倩文于小彤尹铸胜于笑吉克隽逸贾乃亮童苡萱宋奕星刘雨欣刘琳王珞丹姜鸿安泳畅王乐君杨曦莫小棋于越张晓晨袁雨萱马丽林思意陆昱霖宋伊人甘婷婷刘天佐李程林静李明德殷叶子林永健冉旭周迅苏倩薇叶峰任柯诺刘芸叶青马程程卢杉刘恬汝丁婷婷梁晶晶李乃文季晨梁林琳林江国杀漠李帅张梦露张峻宁刘冠翔刘丛丹尹馨梓路晨米紫安黎明杨昆李呈媛徐申东虞书欣余心恬梁爱琪申奥林千鹿李昕岳李萌萌沈航杨童舒刘潺穆乐恩于小伟王彦霖周雨彤侍宣如戚薇李嘉雯王闯李泽余皑磊苑子艺于荣光赵予熙李芯逸刘钇彤侯佩杉侯梦瑶姚奕辰石安妮施潮锦子井星文马晓伟秦岚马灿灿隋咏良楼佳悦陈思成岳旸马靓陈都灵李茜卢星宇李一情何穗李超张炯敏沙溢王挺SNH48陆骏瑶陈雅婷李依伊
        }
    },
    computed: { // 计算属性
        items1 () {
            return [
                {name: '霍建华'}, {name: '张钧甯'}, {name: '陈妍希'}, {name: '陈乔恩'}, {name: '林心如'},
                {name: '欧阳娜娜'}, {name: '郭碧婷'}, {name: '赵又廷'}, {name: '何润东'}, {name: '任容萱'},
                {name: '林志玲'}, {name: '周杰伦'}, {name: '昆凌'}, {name: '舒淇'}, {name: '汪东城'},
                {name: '释小龙'}, {name: '言承旭'}, {name: '应采儿'}, {name: '郑元畅'}, {name: '安以轩'},
                {name: '萧敬腾'}, {name: '任贤齐'}, {name: '苏有朋'}, {name: '高以翔'}, {name: '谢依霖'},
                {name: '王大陆'}, {name: '彭于晏'}, {name: '郭采洁'}, {name: '赵文瑄'}, {name: '阮经天'},
                {name: '贾静雯'}, {name: '吴奇隆'}, {name: '张震'}, {name: '陈柏霖'}, {name: '林依晨'},
                {name: '欧阳妮妮'}, {name: '蔡依林'}, {name: '焦恩俊'}, {name: '欧弟'}, {name: '范逸臣'},
                {name: '吴若瑄'}, {name: '修杰楷'}, {name: '郝劭文'}, {name: '潘玮柏'}, {name: '桂纶镁'},
                {name: '周渝民'}, {name: '林志颖'}, {name: '王力宏'}, {name: '林嘉欣'}, {name: '徐若瑄'},
                {name: '林青霞'}, {name: '徐熙媛'}, {name: '范玮琪'}, {name: '杨丞琳'}, {name: '陈立农'},
                {name: '吴克群'}, {name: '张韶涵'}, {name: '伊能静'}, {name: '田馥甄'}, {name: '陈羽凡'},
                {name: '徐熙娣'}, {name: '王耀庆'}, {name: '周子瑜'}, {name: '萧亚轩'}, {name: '张惠妹'},
                {name: '林彦俊'}, {name: '王心凌'}, {name: '刘若英'}, {name: '邓丽君'}, {name: '曾宝仪'},
                {name: '朱孝天'}, {name: '阿信'}, {name: '吴宗永'}, {name: '宪蔡康'}, {name: '陈汉典'},
                {name: '费翔'}, {name: '马景涛'}, {name: '张信哲'}, {name: '孙燕姿'}, {name: '范晓萱'},
                {name: '萧蔷'}, {name: '张翰'}, {name: '陈志朋'}, {name: '刘谦'}
            ].filter(row => { return !this.name || row.name.indexOf(this.name) > -1 })
        },
        items2 () {
            return [
                {name: '赵丽颖'}, {name: '李易峰'}, {name: '宋轶'}, {name: '杨幂'}, {name: '靳东'},
                {name: ' 张天爱'}, {name: '关晓彤'}, {name: '唐嫣'}, {name: '白敬亭'}, {name: '黄子韬'},
                {name: '迪丽热巴'}, {name: '杨洋'}, {name: '王鸥'}, {name: '尹正'}, {name: '江疏影'},
                {name: 'Angelababy'}, {name: '胡歌'}, {name: '古力娜扎'}, {name: '张翰'}, {name: '王源'},
                {name: '陈学冬'}, {name: '李沁'}, {name: '张馨予'}, {name: '蒋欣'}, {name: '袁姗姗'},
                {name: '杨紫'}, {name: '鹿晗'}, {name: '马天宇'}, {name: '易烊千玺'}, {name: '王凯'},
                {name: '郑爽'}, {name: '吴磊'}, {name: '刘涛'}, {name: '张若昀'}, {name: '王子文'},
                {name: '吴亦凡'}, {name: '刘昊然'}, {name: '范冰冰'}, {name: '佟丽娅'}, {name: '娄艺潇'},
                {name: '林允'}, {name: '高圆圆'}, {name: '王传君'}, {name: '马思纯'}, {name: '陈赫'},
                {name: '李晨'}, {name: '邓超'}, {name: '张一山'}, {name: '井柏然'}, {name: '刘诗诗'},
                {name: '宋茜'}, {name: '王丽坤'}, {name: '张艺兴'}, {name: '刘敏涛'}, {name: '张子枫'},
                {name: '蒋劲夫'}, {name: '柳岩'}, {name: '张子萱'}, {name: '高云翔'}, {name: '孙红雷'},
                {name: '周冬雨'}, {name: '蔡徐坤'}, {name: '黄晓明'}, {name: ''}, {name: '范丞丞'},
                {name: '杨子姗'}, {name: '李小璐'}, {name: '薛之谦'}, {name: '张歆艺'}, {name: '刘亦菲'},
                {name: '李佳航'}, {name: '欧豪'}
            ].filter(row => { return !this.name || row.name.indexOf(this.name) > -1 })
        }
    },
    methods: {
    },
    mounted () {
    }
}
</script>
