<template>
    <div class="blogCss">
        <div class="blog">
            <div class="blogTitle">通过姓的第一个字母来快速展示信息</div>
            <div class="blogContent" v-highlight>
                <p><Icon type="md-checkmark" style="color:green"/> 有效</p>
                <p><Icon type="md-close" style="color:red"/> ------------------------------------------ </p>
                <Row>
                    <Col span="12">
                        <Tag color="green" v-for="(item, index) in items1" :key="'xx'+index">item.name</Tag>
                    </Col>
                    <Col span="12">
                        <Tag color="green" v-for="(item, index) in items2" :key="'xx'+index">item.name</Tag>
                    </Col>
                </Row>
                <p>
                items1: [
                    {name: '霍建华'}, {name: '张钧甯'}, {name: '陈妍希'}, {name: '陈乔恩'}, {name: '林心如'},
                    {name: '欧阳娜娜'}, {name: '郭碧婷'}, {name: '赵又廷'}, {name: '何润东'}, {name: '任容萱'},
                    {name: '林志玲'}, {name: '周杰伦'}, {name: '昆凌'}, {name: '舒淇'}, {name: '汪东城'},
                    {name: '释小龙'}, {name: '言承旭'}, {name: '应采儿'}, {name: '郑元畅'}, {name: '安以轩'},
                    {name: '萧敬腾'}, {name: '任贤齐'}, {name: '苏有朋'}, {name: '高以翔'}, {name: '谢依霖'},
                    {name: '王大陆'}, {name: '彭于晏'}, {name: '郭采洁'}, {name: '赵文瑄'}, {name: '阮经天'},
                    {name: '贾静雯'}, {name: '吴奇隆'}, {name: '张震'}, {name: '陈柏霖'}, {name: '林依晨'},
                    {name: '欧阳妮妮'}, {name: '蔡依林'}, {name: '焦恩俊'}, {name: '欧弟'}, {name: '范逸臣'},
                    {name: '吴若瑄'}, {name: '修杰楷'}, {name: '郝劭文'}, {name: '潘玮柏'}, {name: '桂纶镁'},
                    {name: '周渝民'}, {name: '林志颖'}, {name: '王力宏'}, {name: '林嘉欣'}, {name: '徐若瑄'},
                    {name: '林青霞'}, {name: '徐熙媛'}, {name: '范玮琪'}, {name: '杨丞琳'}, {name: '陈立农'},
                    {name: '吴克群'}, {name: '张韶涵'}, {name: '伊能静'}, {name: '田馥甄'}, {name: '陈羽凡'},
                    {name: '徐熙娣'}, {name: '王耀庆'}, {name: '周子瑜'}, {name: '萧亚轩'}, {name: '张惠妹'},
                    {name: '林彦俊'}, {name: '王心凌'}, {name: '刘若英'}, {name: '邓丽君'}, {name: '曾宝仪'},
                    {name: '朱孝天'}, {name: '阿信'}, {name: '吴宗永'}, {name: '宪蔡康'}, {name: '陈汉典'},
                    {name: ''}, {name: ''}, {name: ''}, {name: ''}, {name: '范晓萱'},
                    {name: ''}, {name: ''}, {name: ''}, {name: ''}, {name: ''},
                    {name: ''}, {name: ''}, {name: ''}, {name: ''}, {name: ''},

                    // 黄瀞怡蔡黄汝张艾嘉叶全真安晨芯王传一秦汉纪亚文吴心缇陈尚泽曲澔濬李依瑾陈艾琳陈嘉桦陈语安纪培慧王思平立威廉猪哥亮杨青倩陈建豪是元介刘冠毅谢盈萱郭鑫孙克杰张勋杰张静懿陈庭萱天心小小彬俞小凡张翰陈志朋詹子晴郑暐达风田赖宗赢吴佩慈曹华恩张行蔡旻佑张景岚江宏恩孟庭丽宋新妮刘奕儿曾之乔王诗安海狗宋达民吕孔维蔡维泽陈怡蓉杨谨华周凯文卓毓彤朱主爱庹宗华姚凤凤刘国劭孟广美孙兴王心嫚田家达夏台凤姚元浩萧蔷席惟伦陈昭荣金超群王宇婕谢坤达傅雷姬天语费翔阿喜周丹莉李国超沈彦廷沈海蓉曾子余潘慧如李志希黄牛黄丽玲陶嫚曼蓝心湄纪言恺刘俊纬黄立行方志友吴思贤宫以腾马景涛包小松陈德容徐佳莹杨千霈陈景炀胡玮杰龙隆李运庆关诗敏曾恺玹刘泯廷许韶洋谢语恩施羽王家梁谭艾珍王彩桦龚继安艾伟徐敏钱韦杉吴辰君黄小柔杨贵媚安东尼王灿张信哲林若亚Selina张瑀希周绍栋杨一展刘汉强古斌阿雅郭源元贺一航吕雪凤孙燕姿唐治平林美秀莫允雯李元太游艾迪安哲张佩华夏靖庭唐德惠侯彦西萧淑慎李罗李沛旭许光汉简嫚书陈为民李国毅林妍柔涂世旻林予晞杨昇达辰烨李佳颖周孝安林秀君赵传秦风邓九云谢雅琳舒子晨翁卡特夏语心傅传杰黄腾浩胡睿儿陈若萍张雁名李妍憬翁滋蔓大飞江淑娜蓝正龙林筱筠梁如瑄阿Ken盛鉴赵擎素珠郑家榆郑人硕李康宜林芯蕾周丹薇孙耀威杨琪安祐德黄裕翔周咏轩蔡昌宪钟欣凌安程希张立威郎祖筠刘谦司徒颖霜丁当陈武康喻虹渊王者心卫子云
                    {name: ''},
                    {name: '赵丽颖'}, {name: '李易峰'}, {name: '宋轶'}, {name: '杨幂'}, {name: '靳东'},
                    {name: ' 张天爱'}, {name: '关晓彤'}, {name: '唐嫣'}, {name: '白敬亭'}, {name: '黄子韬'},
                    {name: '迪丽热巴'}, {name: '杨洋'}, {name: '王鸥'}, {name: '尹正'}, {name: '江疏影'},
                    {name: 'Angelababy'}, {name: '胡歌'}, {name: '古力娜扎'}, {name: '张翰'}, {name: '王源'},
                    {name: '陈学冬'}, {name: '李沁'}, {name: '张馨予'}, {name: '蒋欣'}, {name: '袁姗姗'},
                    {name: '杨紫'}, {name: '鹿晗'}, {name: '马天宇'}, {name: '易烊千玺'}, {name: '王凯'},
                    {name: '郑爽'}, {name: '吴磊'}, {name: '刘涛'}, {name: '张若昀'}, {name: '王子文'},
                    {name: '吴亦凡'}, {name: '刘昊然'}, {name: '范冰冰'}, {name: '佟丽娅'}, {name: ''},
                    {name: '林允'}, {name: '高圆圆'}, {name: ''}, {name: '马思纯'}, {name: '陈赫'},
                    {name: '李晨'}, {name: '邓超'}, {name: ''}, {name: '井柏然'}, {name: '刘诗诗'},
                    {name: ''}, {name: ''}, {name: ''}, {name: ''}, {name: '张子枫'},
                    {name: ''}, {name: ''}, {name: ''}, {name: ''}, {name: '孙红雷'},
                    {name: ''}, {name: ''}, {name: ''}, {name: ''}, {name: '范丞丞'},
                    {name: ''}, {name: ''}, {name: ''}, {name: ''}, {name: '刘亦菲'},

                   成毅安悦溪姜妍 何明翰徐梵溪乔欣马可麦迪娜张铭恩张檬吴优邢昭林邓伦罗云熙贾青陈瑶
                   侯明昊张云龙杨烁胡冰卿牟星张彬彬罗晋谭松韵秦俊杰赵圆瑗唐艺昕李纯毛晓彤梁振伦陈翔吴倩米露TFBOYS颖儿陈晓晁然陈梦希乔任梁孙佳雨李宏毅林秋楠茅子俊唐娜赖雨濛于朦胧徐璐宋茜杨菲洋阚清子孙耀琦张萌田倚凡徐海乔王妍之王丽坤戴向宇刘芊含张一山张艺兴蒋劲夫斓曦熊梓淇李依晓蔡文静杨蓉王珊李心艾余男何杜娟王洋林更新吕一白冰杨玏张雪迎雷佳音赵韩樱子张子萱曹曦月姜潮柳岩孙怡周冬雨米勒蔡徐坤黄晓明焦俊艳杨子姗逯恣祯李溪芮刘美含刘萌萌景甜李一桐杨旭文梁洁毛俊杰万茜高云翔柳希龙娄艺潇郑业成李晟陈小纭黄礼格徐冬冬宋威龙袁冰妍付辛博沈梦辰陈钰琪张歆艺薛之谦蓝盈莹方文强鄂博阎汶宣舒畅牛骏峰李小萌马苏白雪张哲瀚鞠婧祎吕佳容张浩施诗刘敏涛欧豪张嘉倪李菲儿王亭文范世錡海陆马薇邢菲陆毅郭俊辰张丹峰孔垂楠施予斐穆婷婷盛一伦任天野刘奕君杨舒刘庭羽严屹宽孙俪金晨王晓晨任嘉伦李砚尹淇韩栋康杰袁弘韩东君于和伟于晓光陈洁于明加热依扎李佳航张维娜杨之楹李小璐郑恺蒋蕊泽林源王传君张芷溪苏青蓝波杨志刚韩雪白百何李佳奇晏紫东李健高伟光李进荣孙骁骁米热朱一龙于震宋小宝刘芮麟黄渤宋祖儿李兰迪王力可康磊李小冉叶祖新于毅蒋依依李林娟刘波王俊凯胡一天秦海璐石悦安鑫娄清刘娜萍秦语俞飞鸿姚星彤刘楚恬王千源阮圣文孙雪宁李倩祝绪丹颜丹晨母其弥雅刘雅瑟陈紫函应昊茗刘晓洁闫妮刘启恒丁程鑫李梦宋妍霏金瀚尹智玄杨明娜李宗翰虞朗袁志博刘敏任重吴昊宸孙艺洲刘笑歌毛林林何泓姗李郁瞳沈佳妮袁泉宋佳马蜀君尤靖茹闫学晶聂子皓尚语贤俞灏明黄轩吕卓燃李飞周奇奇张予曦刘文曲刘秋实李蓓蕾佟大为刘欢潘之琳梁超泓萱苗驰卢宇静余少群童菲王美人刘颖伦熊乃瑾张碧晨刘黛希马秋子刘烨宋家腾买红妹祖峰瑛子江珊杨雨婷刘成瑞李金铭柯蓝艾晓琪刘馨棋侯梦莎孙铱白宇杜淳马春瑞雨婷儿杨帆韩庚隋雨蒙李颖何晟铭梁亦芸陆子艺张雨绮刘涛于月仙孙坚岳丽娜袁文康梁浩盛冠森李春嫒阳蕾刘恩佑杨梓墨李子峰吴谨言张睿孙茜李茂荣梓杉陆妍淇荣蓉任帅黄一琳原雨殷桃梅婷辛芷蕾刘烨翟天临李欣聪张晓谦李雨轩王珂吴秀波姚笛马伊琍沈腾刘智扬邵兵张楷依于函冰柴碧云刘倩文于小彤尹铸胜于笑吉克隽逸贾乃亮童苡萱宋奕星刘雨欣刘琳王珞丹姜鸿安泳畅王乐君杨曦莫小棋于越张晓晨袁雨萱马丽林思意陆昱霖宋伊人甘婷婷刘天佐李程林静李明德殷叶子林永健冉旭周迅苏倩薇叶峰任柯诺刘芸叶青马程程卢杉刘恬汝丁婷婷梁晶晶李乃文季晨梁林琳林江国杀漠李帅张梦露张峻宁刘冠翔刘丛丹尹馨梓路晨米紫安黎明杨昆李呈媛徐申东虞书欣余心恬梁爱琪申奥林千鹿李昕岳李萌萌沈航杨童舒刘潺穆乐恩于小伟王彦霖周雨彤侍宣如戚薇李嘉雯王闯李泽余皑磊苑子艺于荣光赵予熙李芯逸刘钇彤侯佩杉侯梦瑶姚奕辰石安妮施潮锦子井星文马晓伟秦岚马灿灿隋咏良楼佳悦陈思成岳旸马靓陈都灵李茜卢星宇李一情何穗李超张炯敏沙溢王挺SNH48陆骏瑶陈雅婷李依伊
                ]</p>
                <p></p>
            </div>
            <div class="blogFooter">
                <Tag color="green">收集</Tag>
                <Tag color="cyan">学习</Tag>
                <Tag color="blue">增长</Tag>
            </div>
        </div>
    </div>
</template>
<script>
export default {
    data () {
        return {}
    },
    methods: {
    },
    mounted () {
    }
}
</script>
