<template>
    <div class="blogCss">
        <div class="blog">
            <div class="blogTitle">前端er需要知道的seo知识</div>
            <div class="blogContent" v-highlight>
                <p><Icon type="md-checkmark" style="color:green"/> 有效</p>
                <p><Icon type="md-close" style="color:red"/> ------------------------------------------ </p>
                <p>搜索引擎优化,简称(SEO), 利用搜索引擎的规则提高网站在有关搜索引擎内的自然排名, 为网站提供生态式的自我营销解决方案，使其在行业内占据领先地位，获得品牌收益</p>
                <p>SEO包含站外SEO和站内SEO两方面</p>
                <p>站内</p>
                <ul>
                    <li>网站结构优化,标签语义化</li>
                    <li>META标签优化：例如：TITLE，KEYWORDS，DESCRIPTION等的优化,简称<b>TDK</b>；</li>
                    <li>内部链接的优化，包括相关性链接（Tag标签），锚文本链接，各导航链接，及图片链接；</li>
                    <li>网站内容更新：每天保持站内的更新(主要是文章的更新等)。</li>
                </ul>
                <p>外部优化</p>
                <ul>
                    <li>外部链接类别：友情链接、博客、论坛、B2B、新闻、分类信息、贴吧、知道、百科、站群、相关信息网等尽量保持链接的多样性</li>
                    <li>外链运营：每天添加一定数量的外部链接，使关键词排名稳定提升</li>
                    <li>外链选择：与一些和你网站相关性比较高,整体质量比较好的网站交换友情链接,巩固稳定关键词排名</li>
                </ul>
                <p>搜索引擎如何工作?</p>
                <p>抓取网页</p>
                <p>每个独立的搜索引擎都有自己的网页抓取程序spider(蜘蛛), 负责搜集网页信息</p>
                <p>处理网页</p>
                <p>搜索引擎抓到网页后，行进关键词提取，建立索引库和索引预处理工作</p>
                <p>提供检索服务</p>
                <p>根据用户输入的查询关键字，在索引库中快速检出文档，进行相关度评价和结果排序，将查询结果返回给用户</p>
                <p>上面有提到网页抓取程序spider(蜘蛛)，有的地方也叫机器人(robot), 他们爬取的是网站代码内容，并且用户看到的显示内容, 因此没有文本化直接从数据库中读取的内容，引擎是获取不到的</p>
                <p>单页面的SEO</p>
                <p>单页面（single page application）简称SPA,</p>
                <p>整体优缺点:</p>
                <p>优点:</p>
                <p>用户体验好、快，内容的改变不需要重新加载整个页面</p>
                <p>良好的前后端工作分离模式</p>
                <p>减轻服务器压力</p>
                <p>缺点:</p>
                <p>SEO难度较高</p>
                <p>初次加载耗时多</p>
                <p>SEO优缺点</p>
                <p>优点</p>
                <p>利于集中网站权重</p>
                <p>利于抓取和收录</p>
                <p>利于增强网站的相关性</p>
                <p>缺点</p>
                <p>难获大流量</p>
                <p>内部优化难度大</p>
                <p>跳出率100%</p>
                <p>单页面的SEO如何做？</p>
                <p>Vue => 直接上Nuxt</p>
                <p>React => 直接上Next</p>
                <p>如果我们的首页只有一个登陆按陆怎么办？ 前面站内优化有一点提到网站结构优化，如果咱们的项目是一个单页面并且首页又只有一个登陆的按钮，别说spider会不会对我们产生好感，就连用户都是差评, 谈何收录, 如果受业务羁绊，不能改变这种局面，这时候我们就需要手动生成sitemap提交给搜索引擎，告知搜索引擎我们这里有些页面需要收录, 至于sitemap生成可以找一些开源的库进行处理</p>
                <p>如何检测网站的收录情况?</p>
                <p>基本了解的话在搜索框用site:[domain]即可, 想要准确的数据都得登陆到站长平台(每个独立的搜索引擎都有自己的站长平台)</p>
                <p></p>
            </div>
            <div class="blogFooter">
                <Tag color="green">收集</Tag>
                <Tag color="cyan">学习</Tag>
                <Tag color="blue">增长</Tag>
            </div>
        </div>
    </div>
</template>
<script>
export default {
    data () {
        return {}
    },
    methods: {
    },
    mounted () {
    }
}
</script>
